{
  "main": {
    "works": "Petri Miikki työskentelee",
    "works_short": "Petri työskentelee",
    "open_menu": "Avaa valikko",
    "coming_soon": "Tulossa pian",
    "coming": {
      "pizza": "Pizzaa",
      "hamburger": "Purilaisia",
      "smoking": "Savustusta",
      "software_development": "Mahtavaa softan kehitystä & arkkitehtuuria"
    },
    "cv": "Ansioluettelo",
    "technologies": "Tekninen osaaminen",
    "main_page": "Pääsivu",
    "path_to_awesome_developer": "Polku mahtavaksi kehittäjäksi",
    "chapter": {
      "one": "Kappale 1: Kaikki alkaa motivaatiosta",
      "two": "Kappale 2: Ymmärrä nykyinen osaamisen tasosi",
      "three": "Kappale 3: Itsereflektion taito",
      "four": "Kappale 4: Olio-ohjelmoinnin perusteet"
    }
  },
  "cv": {
    "present": "Nykyhetki",
    "coming_soon": "Petrin ansioluettelo on tulossa pian",
    "education": {
      "header": "Koulutus",
      "school": {
        "saimaa": {
          "name": "Saimaan ammattikorkeakoulu",
          "location": "Lappeenranta, Suomi",
          "description": "Tietotekniikan insinööri (AMK)"
        },
        "juncheng": {
          "name": "Beijing Juncheng Language School",
          "location": "Peking, Kiina",
          "description": "Intensiivinen puolen vuoden kiinan kielen kurssi"
        },
        "btbu": {
          "name": "Beijing Technology and Business University",
          "location": "Peking, Kiina",
          "description": "Kiinan ja liiketalouden opiskelua osana Saimaan ammattikorkeakoulun tutkintoni vaihto-ohjelmaa"
        }
      }
    },
    "profile": {
      "header": "Profiili",
      "pitch": "Tech Lead yli 6 vuoden työkokemuksella työskennellen webbi- ja mobiilisovelluksien parissa. Omaa vahvan motivaation jatkuvalle kehittymiselle sekä itsensä haastamiselle, että pystyn kehittämään itseä ammatillisesti. Mentoroi ja coachaa työkavereita saavuttamaan heidän täyden potentiaalin ja yrityksen tavoitteet.",
      "technical_decisions": "Teknisissä päätöksissä ottaa aina huomioon nykykontekstin sekä päätöksien ROIn, koska ei ole olemassa teknisiä päätöksiä, vain bisnespäätöksiä."
    },
    "skills": {
      "header": "Taidot",
      "architecture": {
        "name": "Ohjelmistoarkkitehtuuri",
        "description": "Monoliiteistä eventteihin perustuviin arkkitehtuureihin. Päätökset arkkitehtuurin osalta tehdään aina perustuen mikä parhaiten tukee bisnestä nyt ja tulevaisuudessa."
      },
      "solid": {
        "name": "SOLID periatteet",
        "description": "Puolestapuhuja hyville suunnittelukäytännöille ja kuinka koodin muuttaminen on mahdollisuus, eikä uhka. Pitänyt workshoppeja "
      },
      "ddd": {
        "name": "Domain driven design",
        "description": "Kun tuotteet ovat monimutkaisia joita isot tiimit ylläpitävät, niin omat taitoni DDDsta mikropalvelu arkkitehtuuritavoista tuo yksinkertaisuutta suunnitteluun."
      },
      "design_patterns": {
        "name": "Software design patterns",
        "description": "Vahvat taidot ohjelmiston suunnittelumalleissa, jotka mahdollistavat että pystyn aina tekemään parhaat päätökset tukemaan liiketoiminnan ja asiakkaiden tarpeita. En ali- tai ylisuunnittele."
      },
      "unit_testing": {
        "name": "Yksikkötestaus",
        "description": "Omaan taidot ottaa johtajuuden määritelläkseni hyvät käytännöt, mallit ja periaatteet yksikkötestaukseen. Olen intohimoinen kirjoittamaan laadukkaita testejä, joita on helppo ylläpitää tulevaisuudessa."
      },
      "coaching_mentoring": {
        "name": "Valmennus ja mentorointi",
        "description": "Aina halukas jakamaan tietoa, mentoroimaan sekä valmentamaan muita, että he pystyvät onnistumaan. Onnistuneesti luonut käytännöt tiedon jakamiseen aiemmassa roolissani."
      }
    },
    "experience": {
      "header": "Kokemus",
      "responsibilities": "Vastuut",
      "achievements": "Saavutukset",
      "tech_lead": {
        "description": "Vahva keskittyminen ROIn näkökulmaan kun kehitämme sovellusta ja miten pystymme parhaiten edistämään tuotteemme liiketoimintaa. Visma Sign -tuotteen teknisen kehittämisen johtaminen, päivittäin koodaten.",
        "responsibilities": {
          "1": "Koodausstandarien määrittely",
          "2": "Koko järjestelmän arkkitehtuuri",
          "3": "Kaikkien eri funktioiden yhteistyön parantaminen Visma Signissa",
          "4": "Omistajuuden ottaminen tuotteen kehityksestä, alihankkijalta Visma Solutions Oylle"
        },
        "achievements": {
          "1": "Uuden tiimin rakentaminen ottamaan vastuun Visma Signin kehittämisestä"
        }
      },
      "mobile_developer": {
        "description": "Mobiilikehityksen aloittaminen Netvisorille. Ensimmäiset 1,5 vuotta ainoa kehittäjä joka työskenteli Netvisor mobiilin parissa. Tämän ansiosta opin nopeaa päätöksen tekemistä ja keskittymään asioihin joilla on oikeasti merkitystä liiketoiminnan suhteen.",
        "responsibilities": {
          "1": "Arkkitehtuurin määrittely ja toteuttaminen Netvisorin mobiilisovellukseen",
          "2": "Netvisorin rajapinnan kehittäminen tukemaan mobiilisovelluksen käyttötapauksia",
          "3": "Mentorinia toimiminen meidän junnu-kehittäjille Netvisorissa",
          "4": "Workshoppien järjestäminen ja pitäminen yksikkötestauksesta, SOLID periaatteista ja domain driven designista"
        },
        "achievements": {
          "1": "Vuoden työntekijä, 2018"
        }
      },
      "software_developer": {
        "description": "Alussa enemmän itsenäistä työskentelyä. Tein paljon suunnitelupäätöksiä toiminnallisuuksiin liittyen mitä tulimme toteuttamaan. Myöhemmin siirryimme tiimityöskentelyyn, niin toimin mentorina tiimimme jäsenille.",
        "responsibilities": {
          "1": "Integraatioiden suunnittelu ja toteuttamin eri järjestelmiin, esimerkiksi Netvisor ID, Visma Scanner ja Visma Webshop",
          "2": "Netvisorin teknisen pohjan parantaminen 'teknisessä neuvostossa', jossa toimin puheenjohtajana",
          "3": "Mentorina toiminen uusille kehittäjille"
        },
        "achievements": {
          "1": "Vuoden työntekijä, 2016",
          "2": "Kuukausittaisten/joka toinen viikko olevien tiedonjaon sessioiden aloittaminen"
        }
      }
    }
  },
  "career": {
    "header": "Polku mahtavaksi softakehittäjäksi",
    "mentoring": {
      "program_synopsis": "Tämä on mentorointiohjelma tarkoitettu kehittämään sinun taitojasi, tietoasi, asennetta sekä motivaatiota että pystyt loistamaan softakehittäjänä. Ohjelma on pääasiassa tarkoitettu junior -tason kehittäjille, koska aloitamme perusteista. Mitä pidemmälle etenemme ohjelmassa, niin siirrymme aihe-alueisiin jotka ovat myös relevantteja enemmän kokeneille kehittäjille.",
      "what_we_will_start_with": "En tarjoa hopealuoteja, että pystyt olemaan mahtava softakehittäjä. Tulemme aloittamaan polun perusteista:",
      "basics": {
        "coding": "Opimme perusteet olio-ohjelmoinnista ja tutustumme myös periaatteisiin funktionaalisesta ohjelmoinnista",
        "design": "Opimme ohjelmistosuunnitteluperiaatteista, aina SOLID -periaatteista eri ohjelmoinnin suunnittelumalleihin",
        "unit_tests": "Opimme hyvistä tavoista kirjoittaa yksikkötestejä jotka tulevat kestämään ajan testin",
        "katas": "Käytämme katoja oppimistyökaluna että nämä asiat tulevat selkärangasta, ilman suurempaa ajattelua",
        "motivation_and_ambition": "Samaan aikaan tulemme myös katsomaan sinun motivaatiotasi ja löytämään kunnianhimoa ollaksesi loistava jossain"
      },
      "what_to_learn_after_basics": "Kun olemme saaneet perusteet kuntoon, niin alamme rakentamaan omaa nettisivustoamme joka tulee olemaan hostattuna AWSssa:",
      "building_website": {
        "domain": "Domainin osto",
        "infrastructure": "Automatisoidaan infra käyttäen Terraformia",
        "frontend": "Luodaan frontend käyttäen Reactia ja Typescriptiä",
        "backend": "Lisätään rajapinta käyttäen palvelittomia teknologioita ja Typescriptiä",
        "pipeline": "Luodaan pipeline automatisoimaan sivustomme julkaisut"
      },
      "we_will_also_touch_following_topics": "Tämä tulee antamaan sinulle hyvän ymmärryksen kuinka rakentaa uusia tuotteita laadukkaasti, samalla käyttäen uusia teknologioita. Nämä taidot tulevat olemaan myös tärkeitä tulevaisuudessa jossa microservicet tulevat olemaan tärkeämmässä roolissa. Kun rakennamme sivustoamme, niin tulemme samalla käsittelemään seuraavia aihealueita:",
      "following_topics": {
        "decisions": "Kuinka tehtä päätöksiä viisaasti",
        "productivity": "Puhumme mikä tekee sinusta tuottavuushirviön ja kuinka pystyt parantamaan sitä",
        "responsibility": "Vastuunottaminen päätöksien tekemisessä",
        "architectures": "Eri arkkitehtuureista, aina monoliiteista palvelimettomiin",
        "test_automation": "Testiautomaatiosta Robot frameworkin kanssa; e2e & integraatio testauksesta",
        "micro": "Microservicet ja microfrontendit"
      },
      "what_this_requires": "Tämä ohjelma tulee kestämään yhden vuoden ja vaatii viisi tuntia aikaa viikossa sinulta. Tulen antamaan myös paljon kirjasuosituksia, joten jos tahdot kehittää itseäsi vielä nopeammin; tulet käyttämään enemmän aikaa viikossa lukien kirjallisuutta."
    },
    "what_do_i_need": {
      "degree": "Tarvitsenko korkeakoulututkintoa?",
      "where_to_start": "Mistä lähteä liikkeelle?",
      "what_programming_language": "Mitä ohjelmointikieltä minun tulisi opetella ensimmäisenä?",
      "getting_first_job": "Miten saan ensimmäisen työpaikkani koodarina?",
      "advancing_in_career": "Miten pystyn etenemään urallani?"
    },
    "good_news": "Sillä välin kun sisältö on vielä työnalla, niin tilaa petri.works ja saa ilmoitukset uusista artikkeleista.",
    "subscribe": {
      "email": "Sähköposti",
      "invalid_email": "Syöttämäsi sähköposti on virheellinen",
      "name": "Nimi",
      "invalid_name": "Nimen pituuden on oltava {{min}} ja {{max}} merkkin välillä",
      "subscribe": "Tilaa",
      "success": "petri.works tilattu onnistuneesti",
      "error": "petri.worksin tilaus epäonnistui"
    }
  }
}