{
  "main": {
    "works": "Petri Miikki works",
    "works_short": "Petri works",
    "coming_soon": "Coming soon",
    "coming": {
      "pizza": "Pizza",
      "hamburger": "Burgers",
      "smoking": "BBQ",
      "software_development": "Awesome software development & architecture"
    },
    "cv": "Curriculum Vitae",
    "main_page": "Main Page",
    "path_to_being_developer": "Path to being a developer"
  },
  "cv": {
    "present": "Present",
    "coming_soon": "Petri's Curriculum Vitae is coming soon",
    "education": {
      "header": "Education",
      "school": {
        "saimaa": {
          "name": "Saimaa University of Applied Sciences",
          "location": "Lappeenranta, Finland",
          "description": "Bachelor of applied sciences"
        },
        "juncheng": {
          "name": "Beijing Juncheng Language School",
          "location": "Beijing, China",
          "description": "Intensive Chinese learning course for half a year"
        },
        "btbu": {
          "name": "Beijing Technology and Business University",
          "location": "Beijing, China",
          "description": "Studying Chinese and business as part of my studies in Saimaa University of Applied Sciences"
        }
      }
    },
    "profile": {
      "header": "Profile",
      "pitch": "Tech Lead with 6+ years of experience working with web and mobile applications. Possesses a strong motivation for continuous improvement and challenging myself to develop professionally. Mentoring and coaching coworkers to achieve their own full potential and company's goals.",
      "technical_decisions": "In technical decision making always taking in to notice current context and return on investment because there is no technical decisions, only business decisions."
    },
    "skills": {
      "header": "Skills",
      "architecture": {
        "name": "Software architecture",
        "description": "From monoliths to event-driven architectures. Making decisions which the best suite business needs."
      },
      "solid": {
        "name": "SOLID principles",
        "description": "Advocate for good design practices and how to embrace code changes as possibilities and not threats. Hold workshops about "
      },
      "ddd": {
        "name": "Domain driven design",
        "description": "When products are complex with bigger teams of maintaining them, my skills of DDD with microservice patterns will bring simplicity to design."
      },
      "design_patterns": {
        "name": "Software design patterns",
        "description": "Strong skills in software design patterns allowing me to make decisions best serving business and customer needs. Doesn't under- or overengineer."
      },
      "unit_testing": {
        "name": "Unit testing",
        "description": "Skills to take the lead of defining good practices, patterns and priciples of unit testing. Passionate about writing high quality tests which are easy maintain in future."
      },
      "coaching_mentoring": {
        "name": "Coaching and mentoring",
        "description": "Always willing to share knowledge, mentor and coach others to succeed. Successfully created practices for knowledge sharing in earlier positions."
      }
    },
    "experience": {
      "header": "Experience",
      "responsibilities": "Responsibilities",
      "achievements": "Achievements",
      "tech_lead": {
        "description": "Strong focus on return on investment on what we are building and what way to best benefit business. Leading technical development of Visma Sign with daily hands-on coding.",
        "responsibilities": {
          "1": "Defining coding standards",
          "2": "Architecture of the whole system",
          "3": "Improving collaboration with all functions within Visma Sign",
          "4": "Taking ownership of system development from subcontractor to Visma Solutions Oy"
        },
        "achievements": {
          "1": "Building new team to take responsibility of the product"
        }
      },
      "mobile_developer": {
        "description": "Started mobile development in Netvisor. For first 1,5 years was the only developer working on Netvisor mobile. This made me learn to be fast decision maker and focus on what actually matters for the business.",
        "responsibilities": {
          "1": "Defining and implementing architecture for Netvisor mobile app",
          "2": "Netvisor API development for supporting mobile use cases",
          "3": "Acting as a mentor for our junior software developers in Netvisor",
          "4": "Hosted workshops about unit testing, SOLID principles and domain driven design"
        },
        "achievements": {
          "1": "Employee of the year, 2018"
        }
      },
      "software_developer": {
        "description": "Worked independently at the start. Made a lot of design decisions for features what we were implementing. After moving towards teams, worked as mentor for our team members.",
        "responsibilities": {
          "1": "Designing and making integrations with other Software systems, for example Netvisor ID, Visma Scanner and Visma Webshop",
          "2": "Worked in 'technical council' as chairman for improving Netvisor's technical base",
          "3": "Acting as mentor for new developers"
        },
        "achievements": {
          "1": "Employee of the year, 2016",
          "2": "Started monthly/biweekly knowledge sharing sessions"
        }
      }
    }
  },
  "career": {
    "header": "Path to developer and beyond",
    "career_as_software_developer": "Have you thought a career as a software developer but are not sure where to start:",
    "what_do_i_need": {
      "degree": "Would I need degree from university?",
      "where_to_start": "Where to start?",
      "what_programming_language": "What programming language should I learn first?",
      "getting_first_job": "How can I land my first job as a software developer?",
      "advancing_in_career": "How can I advance in my career?"
    },
    "good_news": "I have good news for you. I will answer all these questions and help you land your first programming job. While content is under work, please subscribe to petri.works and get notified of new articles."
  }
}
